export type MemoryPoint = {
  lat: number
  lng: number
  title: string
  date?: string
  text?: string
  image?: string // путь к картинке в /public, например "/memories/1.jpg"
}

// Примерные координаты мест в Омске — поменяй под себя
export const omskCenter = { lat: 54.9914, lng: 73.3717 }

// Чтобы точки не накладывались, используем небольшие фиксированные смещения вокруг центра (не случайные)
const offsets = [
  { dLat: -0.0030, dLng: -0.0073 }, //1
  { dLat: 0.00510, dLng: -0.0205 }, //2
  { dLat: -0.0057, dLng: -0.0110 },  //3
  { dLat: -0.006, dLng: -0.0110 }, //4
  { dLat: 0.0018, dLng: 0.0022 }, //5
  { dLat: -0.005, dLng: -0.0058 }, //6
  { dLat: 0.0012, dLng: -0.0016 }, //7
  { dLat: -0.0010, dLng: -0.0012 }, //8
  { dLat: -0.0110, dLng: 0.0003 }, //9
  { dLat: -0.0185, dLng: -0.0680 }, //10
  { dLat: -0.0047, dLng: -0.006 }, //11
  { dLat: -0.005, dLng: -0.0086 }, //12
  { dLat: -0.0065, dLng: -0.002 },  //13
  { dLat: -0.0079, dLng: 0.002 }, //14
  { dLat: 0.00870, dLng: -0.0290 }, //15
  { dLat: -0.0047, dLng: -0.0067 }, //16
  { dLat: -0.0045, dLng: 0.001 }, //17
  { dLat: -0.0002, dLng: -0.0002 } //18
]

function at(i: number) {
  const o = offsets[i % offsets.length]
  return { lat: omskCenter.lat + o.dLat, lng: omskCenter.lng + o.dLng }
}

export const memories: MemoryPoint[] = [
  // 1
  { ...at(0), title: 'Ахахахха я с тобой не дрался', text: 'Пытался поцеловать', image: '/memories/fight.jpg' },
  // 2
  { ...at(1), title: 'Маленькие', text: 'Дуся провожает меня😎', image: '/memories/malinkie.jpg' },
  // 3
  { ...at(2), title: 'Я стою довольный', text: 'Не потому что уронил', image: '/memories/snowboy.jpg' },
  // 4
  { ...at(3), title: 'Чуть уронил Дусю', text: 'Ну бывает ) (я тебе помог)', image: '/memories/snowgirl.jpg' },
  // 5

  // 6
  { ...at(5), title: 'Ахахахах жена чуть бьет', text: 'Но любит', image: '/memories/king.jpg' },
  // 7


  // 9
  { ...at(9), title: 'Едем с меги', text: 'С дорогой мне', image: '/memories/bus.jpg' },
  // 10
  { ...at(8), title: 'Ольга сталкер', text: 'Поцелуй красивый)', image: '/memories/kisssport.jpg' },
  // 11
  { ...at(10), title: 'Лучшие гайсы', text: 'Красотка справа', image: '/memories/school2.jpg' },
  // 12
  { ...at(11), title: 'Тогда было очень дождливо', text: 'Я запомнил это навсегда с тобой', image: '/memories/rain.jpg' },
  // 13
  { ...at(12), title: 'Идем с любимой на треню', text: 'Моя прическа ватафак', image: '/memories/goingsport.jpg' },
  // 14
  { ...at(13), title: 'Дуся оседлала вуш', text: 'Почти поехала', image: '/memories/samokat.jpg' },
  // 15
  { ...at(14), title: 'Всегда рады тебе :)', text: 'Ждем тебя каждый день', image: '/memories/myhome.jpg' },
  // 16
  { ...at(15), title: 'Прическа обезьяны', text: 'Нет ну это круто', image: '/memories/school.jpg' },
  // 17
  { ...at(16), title: 'Моя новая шапка', text: 'Ураа', image: '/memories/fluffy.jpg' },

]


